driver-tests/bpelse/assign/MessageWithNoPartsJBI/test/BPThrowsNoAssignTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpt="http://j2ee.netbeans.org/wsdl/BPThrowsMsgWithNoPartsNoAssign">
  <soapenv:Body>
    <bpt:BPThrowsMsgWithNoPartsNoAssignOperation/>
  </soapenv:Body>
</soapenv:Envelope>